Revit 2015 API
FormatOptions Methods
The FormatOptions type exposes the following members.
Methods
Name | Description
CanHaveUnitSymbol()
 Checks whether a unit symbol can be specified for the display unit in this FormatOptions.
CanHaveUnitSymbol(DisplayUnitType)
 Checks whether a unit symbol can be specified for a given display unit.
CanSuppressLeadingZeros()
 Checks whether leading zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressLeadingZeros(DisplayUnitType)
 Checks whether leading zeros can be suppressed for a given display unit.
CanSuppressSpaces()
 Checks whether spaces can be suppressed for the display unit in this FormatOptions.
CanSuppressSpaces(DisplayUnitType)
 Checks whether spaces can be suppressed for a given display unit.
CanSuppressTrailingZeros()
 Checks whether trailing zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressTrailingZeros(DisplayUnitType)
 Checks whether trailing zeros can be suppressed for a given display unit.
CanUsePlusPrefix()
 Checks whether a plus prefix can be displayed for the display unit in this FormatOptions.
CanUsePlusPrefix(DisplayUnitType)
 Checks whether a plus prefix can be displayed for a given display unit.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetName |  Obsolete.
 Gets the string used in type catalogs to identify the display unit in this FormatOptions.
GetRounding |  Obsolete.
 Gets the accuracy to which values will be rounded.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetValidUnitSymbols()
 Gets all valid unit symbols for the display unit in this FormatOptions.
GetValidUnitSymbols(DisplayUnitType)
 Gets all valid unit symbols for a given display unit.
HasRounding |  Obsolete.
 Checks whether the display unit in this FormatOptions has an accuracy value.
IsValidAccuracy(Double)
 Checks whether an accuracy is valid for the display unit in this FormatOptions.
IsValidAccuracy(DisplayUnitType, Double)
 Checks whether an accuracy is valid for a given display unit.
IsValidForUnitType
 Checks whether this FormatOptions is valid for a given unit type.
IsValidUnitSymbol(UnitSymbolType)
 Checks whether a unit symbol is valid for the display unit in this FormatOptions.
IsValidUnitSymbol(DisplayUnitType, UnitSymbolType)
 Checks whether a unit symbol is valid for a given display unit.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace